#ifndef Mouse_h
#define Mouse_h

class Mouse 
{
public:
	//---------------------------------------------------------
	//更新処理
	//---------------------------------------------------------
	void ThirdPersonPointUpdata();					//三人称視点の時に使用するとよいUpdate(マウスカーソルは中央に固定)
	void FreeUpdate();								//マウスカーソルが画面内を自由に移動できる

	//---------------------------------------------------------
	// 情報取得
	//---------------------------------------------------------
	POINT* GetMousePt();								//MousePt取得
	float GetMoveX();								//x方向の移動量を取得
	float GetMoveY();								//y方向の移動量を取得

	//---------------------------------------------------------
	// シングルトン
	//---------------------------------------------------------
	static Mouse & GetInstance();					//インスタンスの取得
	static void DeleteInstance();					//インスタンスの削除

private:
	Mouse();
	~Mouse();

	//---------------------------------------------------------
	// 定数
	//---------------------------------------------------------
	static const int SENSITIVITY=2;

	//---------------------------------------------------------
	// 変数
	//---------------------------------------------------------
	float movey=0, movex=0;								//マウスのx・yの移動量
	POINT mouseBasePt;								//マウスの座標取得

	//---------------------------------------------------------
	// シングルトン
	//---------------------------------------------------------
	static Mouse* s_Instance;						//インスタンス
	Mouse & operator=(Mouse &);
	Mouse(Mouse&);

};
#define MOUSE Mouse::GetInstance()

#endif