class OpenSSLDH {
public:
	OpenSSLDH();
	~OpenSSLDH();
	void DH_Init(int _keylen=DH_KEYLEN);								//鍵交換に使用するキーの生成
	void DH_CreateKey(char* _pubkey);									//共通鍵に使用するキーの生成

private:
	//---------------------------------------------------------
	//定数
	//---------------------------------------------------------
	static const int DH_KEYLEN = 64;									//2048ぐらいまで設定可能

	//---------------------------------------------------------
	//変数
	//---------------------------------------------------------
	DH* dh_privatekey;													//鍵交換に使用するキー
};

////////////////////////////////////////////////////////////////////
//キーの構造体の定義
////////////////////////////////////////////////////////////////////
typedef struct dh_st
{
	BIGNUM *p;  // P
	BIGNUM *g;  // G
	BIGNUM *pub_key;  // Y
	BIGNUM *priv_key;  // X
} DH;

